###############################################################################
# Created by write_sdc
# Mon Mar  4 12:10:32 2024
###############################################################################
current_design dff_ram
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[64]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[65]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[66]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[67]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[68]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[69]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[70]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[71]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {enb}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[32]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[33]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[34]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[35]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[36]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[37]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[38]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[39]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[40]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[41]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[42]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[43]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[44]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[45]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[46]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[47]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[48]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[49]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[50]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[51]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[52]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[53]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[54]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[55]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[56]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[57]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[58]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[59]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[60]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[61]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[62]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[63]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[64]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[65]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[66]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[67]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[68]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[69]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[70]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[71]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r_data[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {r_data[71]}]
set_load -pin_load 0.0334 [get_ports {r_data[70]}]
set_load -pin_load 0.0334 [get_ports {r_data[69]}]
set_load -pin_load 0.0334 [get_ports {r_data[68]}]
set_load -pin_load 0.0334 [get_ports {r_data[67]}]
set_load -pin_load 0.0334 [get_ports {r_data[66]}]
set_load -pin_load 0.0334 [get_ports {r_data[65]}]
set_load -pin_load 0.0334 [get_ports {r_data[64]}]
set_load -pin_load 0.0334 [get_ports {r_data[63]}]
set_load -pin_load 0.0334 [get_ports {r_data[62]}]
set_load -pin_load 0.0334 [get_ports {r_data[61]}]
set_load -pin_load 0.0334 [get_ports {r_data[60]}]
set_load -pin_load 0.0334 [get_ports {r_data[59]}]
set_load -pin_load 0.0334 [get_ports {r_data[58]}]
set_load -pin_load 0.0334 [get_ports {r_data[57]}]
set_load -pin_load 0.0334 [get_ports {r_data[56]}]
set_load -pin_load 0.0334 [get_ports {r_data[55]}]
set_load -pin_load 0.0334 [get_ports {r_data[54]}]
set_load -pin_load 0.0334 [get_ports {r_data[53]}]
set_load -pin_load 0.0334 [get_ports {r_data[52]}]
set_load -pin_load 0.0334 [get_ports {r_data[51]}]
set_load -pin_load 0.0334 [get_ports {r_data[50]}]
set_load -pin_load 0.0334 [get_ports {r_data[49]}]
set_load -pin_load 0.0334 [get_ports {r_data[48]}]
set_load -pin_load 0.0334 [get_ports {r_data[47]}]
set_load -pin_load 0.0334 [get_ports {r_data[46]}]
set_load -pin_load 0.0334 [get_ports {r_data[45]}]
set_load -pin_load 0.0334 [get_ports {r_data[44]}]
set_load -pin_load 0.0334 [get_ports {r_data[43]}]
set_load -pin_load 0.0334 [get_ports {r_data[42]}]
set_load -pin_load 0.0334 [get_ports {r_data[41]}]
set_load -pin_load 0.0334 [get_ports {r_data[40]}]
set_load -pin_load 0.0334 [get_ports {r_data[39]}]
set_load -pin_load 0.0334 [get_ports {r_data[38]}]
set_load -pin_load 0.0334 [get_ports {r_data[37]}]
set_load -pin_load 0.0334 [get_ports {r_data[36]}]
set_load -pin_load 0.0334 [get_ports {r_data[35]}]
set_load -pin_load 0.0334 [get_ports {r_data[34]}]
set_load -pin_load 0.0334 [get_ports {r_data[33]}]
set_load -pin_load 0.0334 [get_ports {r_data[32]}]
set_load -pin_load 0.0334 [get_ports {r_data[31]}]
set_load -pin_load 0.0334 [get_ports {r_data[30]}]
set_load -pin_load 0.0334 [get_ports {r_data[29]}]
set_load -pin_load 0.0334 [get_ports {r_data[28]}]
set_load -pin_load 0.0334 [get_ports {r_data[27]}]
set_load -pin_load 0.0334 [get_ports {r_data[26]}]
set_load -pin_load 0.0334 [get_ports {r_data[25]}]
set_load -pin_load 0.0334 [get_ports {r_data[24]}]
set_load -pin_load 0.0334 [get_ports {r_data[23]}]
set_load -pin_load 0.0334 [get_ports {r_data[22]}]
set_load -pin_load 0.0334 [get_ports {r_data[21]}]
set_load -pin_load 0.0334 [get_ports {r_data[20]}]
set_load -pin_load 0.0334 [get_ports {r_data[19]}]
set_load -pin_load 0.0334 [get_ports {r_data[18]}]
set_load -pin_load 0.0334 [get_ports {r_data[17]}]
set_load -pin_load 0.0334 [get_ports {r_data[16]}]
set_load -pin_load 0.0334 [get_ports {r_data[15]}]
set_load -pin_load 0.0334 [get_ports {r_data[14]}]
set_load -pin_load 0.0334 [get_ports {r_data[13]}]
set_load -pin_load 0.0334 [get_ports {r_data[12]}]
set_load -pin_load 0.0334 [get_ports {r_data[11]}]
set_load -pin_load 0.0334 [get_ports {r_data[10]}]
set_load -pin_load 0.0334 [get_ports {r_data[9]}]
set_load -pin_load 0.0334 [get_ports {r_data[8]}]
set_load -pin_load 0.0334 [get_ports {r_data[7]}]
set_load -pin_load 0.0334 [get_ports {r_data[6]}]
set_load -pin_load 0.0334 [get_ports {r_data[5]}]
set_load -pin_load 0.0334 [get_ports {r_data[4]}]
set_load -pin_load 0.0334 [get_ports {r_data[3]}]
set_load -pin_load 0.0334 [get_ports {r_data[2]}]
set_load -pin_load 0.0334 [get_ports {r_data[1]}]
set_load -pin_load 0.0334 [get_ports {r_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {enb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[71]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[70]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[69]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[68]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[67]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[66]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[65]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[64]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
